/******************************************************************************/
/** 模块名称：扩展外设驱动                                                   **/
/** 文件名称：lcd1602function.h                                              **/
/** 版    本：V1.0.0                                                         **/
/** 简    介：应用于LCD1602液晶屏的操作                                      **/
/**           采用HD4470及兼容芯片,基本操作时序：                            **/
/**           +------+-------------------------------+------------+          **/
/**           | 操作 |             输入              |    输出    |          **/
/**           +------+-------------------------------+------------+          **/
/**           |读状态|RS=L,RW=H,E=H                  |D0-D7=状态字|          **/
/**           +------+-------------------------------+------------+          **/
/**           |写指令|RS=L,RW=L,D0-D7=指令码,E=高脉冲|无          |          **/
/**           +------+-------------------------------+------------+          **/
/**           |读数据|RS=H,RW=H,E=H                  |D0-D7=数据  |          **/
/**           +------+-------------------------------+------------+          **/
/**           |写数据|RS=H,RW=L,D0-D7=数据,E=高脉冲  |无          |          **/
/**           +------+-------------------------------+------------+          **/
/**           显示模式设置：                                                 **/
/**           +---------------+----------------------------------+           **/
/**           |    指令码     |              功能                |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           |0|0|1|1|1|0|0|0|设置16x2显示，5x7点阵，8位数据接口|           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           显示开/关及光标设置：                                          **/
/**           +---------------+----------------------------------+           **/
/**           |    指令码     |              功能                |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           |0|0|0|0|1|D|C|B|D=1 开显示；D=0关显示             |           **/
/**           | | | | | | | | |C=1 显示光标；C=0 不显示光标      |           **/
/**           | | | | | | | | |B=1 光标闪烁；C=0 光标不闪烁      |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           |0|0|0|0|0|1|N|S|N=1 读写后指针和贯标加1           |           **/
/**           | | | | | | | | |N=0 读写后指针和贯标减1           |           **/
/**           | | | | | | | | |S=1 写一个字符后整屏移动，方向随N |           **/
/**           | | | | | | | | |S=0 写一个字符后整屏显示不移动    |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           其他设置：                                                     **/
/**           +---------------+----------------------------------+           **/
/**           |    指令码     |              功能                |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           |0|0|0|0|0|0|0|1|显示清屏，指针和显示均清零        |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           |0|0|0|0|0|0|1|0|显示回车，数据指针清零            |           **/
/**           +-+-+-+-+-+-+-+-+----------------------------------+           **/
/**           数据指针设置，地址码0-27H，40H-67H：                           **/
/**           +---------------+----------------------------------+           **/
/**           |    指令码     |              功能                |           **/
/**           +---------------+----------------------------------+           **/
/**           |80H+地址码     |设置数据地址指针                  |           **/
/**           +---------------+----------------------------------+           **/
/**--------------------------------------------------------------------------**/
/**使用说明：                                                                **/
/**    1、声明LCD1602ObjectType对象实体，并调用函数LCD1602Initialization初   **/
/**       始化对象实体。并配置好硬件接口，采用并行通讯。                     **/
/**    2、实现三个形如void f(uint8_t value)的引脚输出操作函数，分别操RS、    **/
/**       RW、EN。并声明LCD1602PinSetType类型3个元素的函数指针数组，RS的操   **/
/**       作函数作为第一个元素，RW的操作函数作为第二个元素，EN的操作函数作   **/
/**       为第三个元素。并将函数指针数组的指针赋值给LCD1602ObjectType对象实  **/
/**       体的PinHandle函数指针。实现对RS、RW、EN三个引脚的操作。            **/
/**    3、实现形如uint8_t f(void)的函数，并将其赋值给LCD1602ObjectType对象实 **/
/**       体的GetByte函数指针。实现获取一个字节的数据。                      **/
/**    4、实现形如void f(uint8_t)的函数，并将其赋值给LCD1602ObjectType对象实 **/
/**       体的SendByte函数指针。实现发送一个字节的数据                       **/
/**    5、实现形如void f(volatile uint32_t period)的函数，并将其赋值给       **/
/**       LCD1602ObjectType对象实体的Delayus函数指针。实现操作延时，单位微秒 **/
/**    6、实现形如void f(volatile uint32_t nTime)的函数，并将其赋值给        **/
/**       LCD1602ObjectType对象实体的Delayms函数指针。实现操作延时，单位毫秒 **/
/**    7、调用相应的函数实现需要的操作。                                     **/
/**--------------------------------------------------------------------------**/
/** 修改记录：                                                               **/
/**     版本      日期              作者              说明                   **/
/**     V1.0.0  2017-07-17          木南              创建文件               **/
/**                                                                          **/
/******************************************************************************/ 

#ifndef __LCD1602FUNCTION_H
#define __LCD1602FUNCTION_H

#include <stdarg.h>
#include <stdint.h>

/*定义显示行数枚举*/
typedef enum LCD1602DisplayLine{
  LCD1602_FirstLine=0,
  LCD1602_SecondLine,
  LCD1602_AllLine
}LCD1602DisplayLineType;

/*定义LCD1602控制引脚枚举*/
typedef enum LCD1602Pin{
  LCD1602_RS=0,
  LCD1602_RW=1,
  LCD1602_EN=2
}LCD1602PinType;

/*定义引脚操作函数指针类型*/
typedef void (*LCD1602PinSetType)(uint8_t value);

/* 定义LCD1602的对象类型 */
typedef struct LCD1602Object {
  uint8_t status;
  LCD1602PinSetType *PinHandle;
  void(*SendByte)(uint8_t data);
  uint8_t(*GetByte)(void);
  void (*Delayus)(volatile uint32_t period);    //微秒延时函数
  void (*Delayms)(volatile uint32_t nTime);     //毫秒秒延时函数
}LCD1602ObjectType;

/*定义发送一个字节操作函数指针*/
typedef void(*LCD1602SendByteType)(uint8_t data);
/*定义读取一个字节操作函数指针*/
typedef uint8_t(*LCD1602GetByteType)(void);
/*定义延时操作函数指针*/
typedef void (*LCD1602DelayType)(volatile uint32_t time);

/*对显示屏作初始化配置*/
void LCD1602Initialization(LCD1602ObjectType *lcd,              //LCD1602对象指针
                           LCD1602PinSetType *PinHandle,         //控制引脚操作函数指针数组
                           LCD1602SendByteType sendByte,        //发送一个字节函数指针
                           LCD1602GetByteType getByte,          //读取一个字节函数指针
                           LCD1602DelayType delayus,            //微秒延时函数指针
                           LCD1602DelayType delayms             //毫秒延时函数指针
                             );
/*向LCD1602设定显示内容*/
void Lcd1602ContentDisplay(LCD1602ObjectType *lcd,uint8_t pos,char *fmt,...);
/*清除LCD1602的显示*/
void LCD1602DisplayClear(LCD1602ObjectType *lcd,LCD1602DisplayLineType dLine);

#endif
/*********** (C) COPYRIGHT 1999-2019 Moonan Technology *********END OF FILE****/
